In [2]:
import numpy as np
import pandas as pd

In [6]:
type(np.arange(9).reshape((3,3)))

numpy.ndarray

In [8]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [9]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [10]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [21]:
data.iloc[:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [24]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [34]:
data[data.three > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [36]:
data.loc['Ohio', 'one']

0

In [37]:
ser = pd.Series(np.arange(3.))

In [38]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [40]:
ser[0]

0.0

In [41]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [42]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [43]:
ser2[-1]

2.0

In [44]:
ser2['a']

0.0

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [5]:
df

      data1     data2 key1 key2
0  0.881550 -1.384282    a  one
1  0.649145 -1.234509    a  two
2 -0.934233  0.504132    b  one
3 -0.031421  0.805618    b  two
4  1.269088 -0.134276    a  one

In [7]:
grouped = df['data1'].groupby(df['key1'])

In [9]:
grouped.mean()

key1
a    0.933261
b   -0.482827
Name: data1, dtype: float64

In [10]:
grouped = df['data1'].groupby([df['key1'], df['key2']])

In [14]:
means = grouped.mean()

In [15]:
means.unstack()

key2       one       two
key1
a     1.075319  0.649145
b    -0.934233 -0.031421

In [16]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [17]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [18]:
df

      data1     data2 key1 key2
0  0.881550 -1.384282    a  one
1  0.649145 -1.234509    a  two
2 -0.934233  0.504132    b  one
3 -0.031421  0.805618    b  two
4  1.269088 -0.134276    a  one

In [19]:
df[['data1', 'data2']]

      data1     data2
0  0.881550 -1.384282
1  0.649145 -1.234509
2 -0.934233  0.504132
3 -0.031421  0.805618
4  1.269088 -0.134276

In [20]:
df['data1']

0    0.881550
1    0.649145
2   -0.934233
3   -0.031421
4    1.269088
Name: data1, dtype: float64

In [21]:
type(df['data1'])

pandas.core.series.Series

In [22]:
df['data1'].max()

1.2690876491365397

In [23]:
df['data1'].min()

-0.9342329922633699

In [24]:
pd.Series(10)

0    10
dtype: int64